0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    parede
    {
	type symmetry;
        //type            calculated;
    }
    extremos
    {
        type            fixedValue;
	value		uniform 0;
    }
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }

    cladding_to_coolant
    {
      type            calculated;
    }

    cladding_to_fuel
    {
      type            calculated;   
    }
}


// ************************************************************************* //
